app/controllers/conversions_controller.rb

  def index
    @conversions = Conversion.all
---
SELECT * FROM `conversions`

  def create
    @conversion = Conversion.new(params[:conversion])

    respond_to do |format|
      if @conversion.save
---
INSERT INTO `conversions` (`currency_out`, `currency_in`, `updated_at`, `last`, `first`, `created_at`) VALUES(NULL, NULL, '2010-07-17 13:41:11', NULL, NULL, '2010-07-17 13:41:11')