app/controllers/exposures_controller.rb

  def index
    @exposures = Exposure.all
---
SELECT * FROM `exposures`

  def graph
	  @exposure = Exposure.find(params[:id])
	  project_name = @exposure.tender.project.name
	  group_name = @exposure.tender.user.group.name
	  tender_desc = @exposure.tender.description
	  direction = "Cash Out"
	  direction = "Cash In" if @exposure.supply
	  currency_1 = @exposure.currency_in_symbol?
	  currency_2 = @exposure.currency_out_symbol?
	  currency_1_and_2 = "#{currency_1} => #{currency_2}"
	  title = "#{project_name}:#{group_name}:#{tender_desc}\n"
	  title += "#{direction}:#{currency_1_and_2}"
	  factors = Array.new
	  carrieds = Array.new
	  days = Array.new
	  bid_to_ntp = Array.new
	  @exposure.rates.each do |r|
---
SELECT * FROM `exposures` WHERE (`exposures`.`id` = 1)
SELECT * FROM `groups` WHERE (`groups`.`id` = 790271446)
SELECT * FROM `projects` WHERE (`projects`.`id` = 566274319)
SELECT * FROM `tenders` WHERE (`tenders`.`id` = 478112799)
SELECT * FROM `users` WHERE (`users`.`id` = 846114006)
SELECT * FROM `currencies` WHERE (`currencies`.`id` = 9)
SELECT * FROM `rates` WHERE (`rates`.exposure_id = 1)

  def show
    @exposure = Exposure.find(params[:id])
---
SELECT * FROM `exposures` WHERE (`exposures`.`id` = 1)