app/controllers/groups_controller.rb

SELECT * FROM `groups` WHERE (`groups`.`id` = 291385784)
---
  def show
    Group.rebuild! if nil.|Group.find(:first).rgt

SELECT * FROM `groups` WHERE (`groups`.`id` = 445636402)
---
  def edit
    Group.rebuild! if nil.|Group.find(:first).rgt