app/controllers/priviledges_controller.rb

INSERT INTO `priviledges` (`level_id`, `updated_at`, `group_id`, `user_id`, `created_at`) VALUES(NULL, '2010-07-17 13:41:12', NULL, NULL, '2010-07-17 13:41:12')
---
  def create
    @priviledge = Priviledge.new(params[:priviledge])

    respond_to do |format|
      if @priviledge.save