app/controllers/tenders_controller.rb

  def index
    @tenders = Tender.all
---
SELECT * FROM `tenders`

  def show
    @tender = Tender.find(params[:id])
---
SELECT * FROM `tenders` WHERE (`tenders`.`id` = 478112799)