app/controllers/users_controller.rb

SELECT * FROM `users` ORDER BY login
---
  def index
    @users = User.all

SELECT * FROM `users` WHERE (`users`.`id` = 846114032) ORDER BY login LIMIT 1
---
  def show
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 846114006) ORDER BY login
---
  def edit
    @user = User.find(params[:id])

SELECT `users`.id FROM `users` WHERE (LOWER(`users`.`email`) = BINARY 'tester@testing.com') LIMIT 1
INSERT INTO `accounts` (`period`, `paypal`, `updated_at`, `currency_id`, `cc_name`, `creator_id`, `type_id`, `external_id`, `payment`, `ccnum`, `address_id`, `rules_id`, `cc_exp`, `created_at`) VALUES(1, NULL, '2010-07-18 02:33:52', NULL, NULL, 846114007, NULL, NULL, 0.0, NULL, NULL, NULL, NULL, '2010-07-18 02:33:52')
INSERT INTO `groups` (`name`, `updated_at`, `account_id`, `lft`, `parent_id`, `rgt`, `created_at`) VALUES('test group', '2010-07-18 02:33:52', 221168074, 3, NULL, 4, '2010-07-18 02:33:52')
INSERT INTO `users` (`name`, `rating`, `last_login_at`, `last_request_at`, `updated_at`, `crypted_password`, `account_id`, `password_salt`, `current_login_at`, `group_id`, `failed_login_count`, `persistence_token`, `login_count`, `login`, `email`, `created_at`) VALUES('Tester', NULL, NULL, '2010-07-18 02:33:52', '2010-07-18 02:33:52', 'd53000a60360b877013f94bd7dcd91e467e9d76177caa3e4795013d6ed82701583d6bf1b7429fdffd5a761ffea58714cc5ac8774d37557c67c3845c7e50f8e74', NULL, 'Axk3boC280jbQ0_Yh__-', '2010-07-18 02:33:52', NULL, 0, 'e5db15aebc086b31319001bb87ec10e9d75068ab2e7ec1516d083bd6fac90f55c1bb88bcdc93c0a5fbc0cbf8ad76bc4c84b46b173bd9110a721091594a763bc3', 1, 'tester', 'tester@testing.com', '2010-07-18 02:33:52')
UPDATE `groups` SET `lft` = CASE WHEN `lft` BETWEEN 2 AND 2 THEN `lft` + 4 - 2 WHEN `lft` BETWEEN 3 AND 4 THEN `lft` + 2 - 3 ELSE `lft` END, `rgt` = CASE WHEN `rgt` BETWEEN 2 AND 2 THEN `rgt` + 4 - 2 WHEN `rgt` BETWEEN 3 AND 4 THEN `rgt` + 2 - 3 ELSE `rgt` END, `parent_id` = CASE WHEN id = 1072752377 THEN 1072752376 ELSE `parent_id` END
UPDATE `users` SET `updated_at` = '2010-07-17 15:01:40', `last_request_at` = '2010-07-17 15:01:40' WHERE `id` = 846114022
INSERT INTO `priviledges` (`level_id`, `updated_at`, `group_id`, `user_id`, `created_at`) VALUES(NULL, '2010-07-17 14:03:06', 1072752366, 846114007, '2010-07-17 14:03:06')
SELECT * FROM `groups` WHERE (`groups`.`name` = 'Base') LIMIT 1
SELECT * FROM `levels` WHERE (`levels`.`name` = 'user') ORDER BY step DESC LIMIT 1
SELECT max(`groups`.rgt) AS max_rgt FROM `groups`
---
	def create
		@user = User.new(params[:user])
		@user.login ||= @user.email   #only email is required to create an account
		@user.name ||= @user.login    #these two fields can be edited later
		params[:group][:name] ||= @user.login #same for the group param

		#a completely new group should only have a name, with id = nil.
		@user.account = @group.account if @group = Group.find_by_id(params[:group][:group_id])
    message = nil

		respond_to do |format|
		  begin
		    User.transaction do
			    @group ||= Group.new(params[:group])
  				@user.account ||= Account.create!()  #only create new account if it is empty
  				@user.save!
  				@user.account.creator_id = @user.id
   				UserSession.create(:login => params[:user][:login], :password => params[:user][:password])
  				@group.account = @user.account
  				@user.account.save!
  				@group.save!
			    Priviledge.create!(:user => @user, :group => @group, :level => Level.find_by_name('user'))
  				base = base_group     #base_group defined in application_controller
  				Group.rebuild! unless base.lft || base.rgt  #needed for testing
  				@group.move_to_child_of(base) if @group.parent_id.blank?

SELECT * FROM `users` WHERE (`users`.`id` = 846114006) ORDER BY login
---
  def update
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 846114006) ORDER BY login
DELETE FROM `users` WHERE `id` = 846114006
---
  def destroy
    @user = User.find(params[:id])
    #p (@user == current_user).to_s
    @user.destroy if @user == current_user